set sdc_version 1.4

create_clock -period 1.5 -waveform {0 0.75 } [get_ports {CLK}]
set_input_delay 0.001 -max -clock "iCLK" [get_ports {Xi}]
set_input_delay 0.001 -max -clock "iCLK" [get_ports {Yi}]
set_input_delay 0.001 -max -clock "iCLK" [get_ports {PREDICT}]
dc::set_dont_use FA1D*
set_attribute lp_insert_clock_gating true
