# ####################################################################

#  Created by Encounter(R) RTL Compiler RC14.28 - v14.20-s067_1 on Thu Dec 14 13:40:05 -0600 2017

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design lrm

create_clock -name "CLK" -add -period 3.15 -waveform {0.0 1.575} [get_ports CLK]
group_path -name cg_enable_group_CLK -through [list \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST1/enable]  \
  [get_pins RC_CG_HIER_INST2/enable]  \
  [get_pins RC_CG_HIER_INST3/enable]  \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST1/enable]  \
  [get_pins RC_CG_HIER_INST2/enable]  \
  [get_pins RC_CG_HIER_INST3/enable] ]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Xi[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Xi[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Xi[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Xi[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Xi[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Xi[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Xi[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Xi[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Yi[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Yi[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Yi[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Yi[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Yi[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Yi[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Yi[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports {Yi[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.001 [get_ports PREDICT]
set_wire_load_mode "segmented"
set_wire_load_selection_group "WireAreaForZero" -library "tcbn65gpluswc"
set_dont_use [get_lib_cells tcbn65gpluswc/ANTENNA]
set_dont_use [get_lib_cells tcbn65gpluswc/BHD]
set_dont_use [get_lib_cells tcbn65gpluswc/BUFFD20]
set_dont_use [get_lib_cells tcbn65gpluswc/BUFFD24]
set_dont_use [get_lib_cells tcbn65gpluswc/BUFTD20]
set_dont_use [get_lib_cells tcbn65gpluswc/BUFTD24]
set_dont_use [get_lib_cells tcbn65gpluswc/CKBD20]
set_dont_use [get_lib_cells tcbn65gpluswc/CKBD24]
set_dont_use [get_lib_cells tcbn65gpluswc/CKLHQD20]
set_dont_use [get_lib_cells tcbn65gpluswc/CKLHQD24]
set_dont_use [get_lib_cells tcbn65gpluswc/CKLNQD20]
set_dont_use [get_lib_cells tcbn65gpluswc/CKLNQD24]
set_dont_use [get_lib_cells tcbn65gpluswc/CKND20]
set_dont_use [get_lib_cells tcbn65gpluswc/CKND24]
set_dont_use [get_lib_cells tcbn65gpluswc/DCAP]
set_dont_use [get_lib_cells tcbn65gpluswc/DCAP4]
set_dont_use [get_lib_cells tcbn65gpluswc/DCAP8]
set_dont_use [get_lib_cells tcbn65gpluswc/DCAP16]
set_dont_use [get_lib_cells tcbn65gpluswc/DCAP32]
set_dont_use [get_lib_cells tcbn65gpluswc/DCAP64]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL0]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL005]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL01]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL015]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL02]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL1]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL2]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL3]
set_dont_use [get_lib_cells tcbn65gpluswc/DEL4]
set_dont_use [get_lib_cells tcbn65gpluswc/GAN2D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GAN2D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GAOI21D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GAOI21D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GAOI22D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GBUFFD1]
set_dont_use [get_lib_cells tcbn65gpluswc/GBUFFD2]
set_dont_use [get_lib_cells tcbn65gpluswc/GBUFFD3]
set_dont_use [get_lib_cells tcbn65gpluswc/GBUFFD4]
set_dont_use [get_lib_cells tcbn65gpluswc/GBUFFD8]
set_dont_use [get_lib_cells tcbn65gpluswc/GDCAP]
set_dont_use [get_lib_cells tcbn65gpluswc/GDCAP2]
set_dont_use [get_lib_cells tcbn65gpluswc/GDCAP3]
set_dont_use [get_lib_cells tcbn65gpluswc/GDCAP4]
set_dont_use [get_lib_cells tcbn65gpluswc/GDCAP10]
set_dont_use [get_lib_cells tcbn65gpluswc/GDFCNQD1]
set_dont_use [get_lib_cells tcbn65gpluswc/GDFQD1]
set_dont_use [get_lib_cells tcbn65gpluswc/GINVD1]
set_dont_use [get_lib_cells tcbn65gpluswc/GINVD2]
set_dont_use [get_lib_cells tcbn65gpluswc/GINVD3]
set_dont_use [get_lib_cells tcbn65gpluswc/GINVD4]
set_dont_use [get_lib_cells tcbn65gpluswc/GINVD8]
set_dont_use [get_lib_cells tcbn65gpluswc/GMUX2D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GMUX2D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GMUX2ND1]
set_dont_use [get_lib_cells tcbn65gpluswc/GMUX2ND2]
set_dont_use [get_lib_cells tcbn65gpluswc/GND2D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GND2D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GND2D3]
set_dont_use [get_lib_cells tcbn65gpluswc/GND2D4]
set_dont_use [get_lib_cells tcbn65gpluswc/GND3D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GND3D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GNR2D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GNR2D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GNR3D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GNR3D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GOAI21D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GOAI21D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GOR2D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GOR2D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GSDFCNQD1]
set_dont_use [get_lib_cells tcbn65gpluswc/GTIEH]
set_dont_use [get_lib_cells tcbn65gpluswc/GTIEL]
set_dont_use [get_lib_cells tcbn65gpluswc/GXNR2D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GXNR2D2]
set_dont_use [get_lib_cells tcbn65gpluswc/GXOR2D1]
set_dont_use [get_lib_cells tcbn65gpluswc/GXOR2D2]
set_dont_use [get_lib_cells tcbn65gpluswc/INVD20]
set_dont_use [get_lib_cells tcbn65gpluswc/INVD24]
set_dont_use [get_lib_cells tcbn65gpluswc/OD18DCAP16]
set_dont_use [get_lib_cells tcbn65gpluswc/OD18DCAP32]
set_dont_use [get_lib_cells tcbn65gpluswc/OD18DCAP64]
set_clock_latency -max 0 [get_pins {den_reg[0]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[10]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[11]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[12]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[13]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[14]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[15]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[16]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[17]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[18]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[19]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[1]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[20]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[21]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[22]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[23]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[24]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[25]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[26]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[27]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[28]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[29]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[2]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[30]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[31]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[3]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[4]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[5]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[6]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[7]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[8]/EN}]
set_clock_latency -max 0 [get_pins {den_reg[9]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[0]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[10]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[11]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[12]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[13]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[14]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[15]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[16]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[17]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[18]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[19]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[1]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[20]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[21]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[22]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[23]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[24]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[25]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[26]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[27]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[28]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[29]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[2]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[30]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[31]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[3]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[4]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[5]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[6]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[7]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[8]/EN}]
set_clock_latency -max 0 [get_pins {num_reg[9]/EN}]
set_clock_latency -max 0 [get_pins {X_reg[7]/E}]
set_clock_latency -max 0 [get_pins {X_reg[6]/E}]
set_clock_latency -max 0 [get_pins {X_reg[4]/E}]
set_clock_latency -max 0 [get_pins {X_reg[0]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[24]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[8]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[7]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[23]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[6]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[5]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[31]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[22]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[4]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[3]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[21]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[2]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[31]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[1]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[30]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[29]/E}]
set_clock_latency -max 0 [get_pins {X_reg[3]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[30]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[20]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[0]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[28]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[27]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[26]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[25]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[19]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[24]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[23]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[22]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[21]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[29]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[18]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[20]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[19]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[18]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[17]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[17]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[16]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[15]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[14]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[13]/E}]
set_clock_latency -max 0 [get_pins {X_reg[5]/E}]
set_clock_latency -max 0 [get_pins {X_reg[2]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[28]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[16]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[12]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[11]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[10]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[9]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[15]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[8]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[7]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[6]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[5]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[27]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[14]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[4]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[3]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[2]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[1]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[13]/E}]
set_clock_latency -max 0 [get_pins {num2_reg[0]/E}]
set_clock_latency -max 0 [get_pins {X_reg[1]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[26]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[12]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[11]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[25]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[10]/E}]
set_clock_latency -max 0 [get_pins {den2_reg[9]/E}]
set_clock_latency -max 0 [get_pins {M1_x_reg[0]/E}]
set_clock_latency -max 0 [get_pins {M1_x_reg[1]/E}]
set_clock_latency -max 0 [get_pins {M1_x_reg[2]/E}]
set_clock_latency -max 0 [get_pins {M1_x_reg[3]/E}]
set_clock_latency -max 0 [get_pins {M1_x_reg[4]/E}]
set_clock_latency -max 0 [get_pins {M1_x_reg[5]/E}]
set_clock_latency -max 0 [get_pins {M1_x_reg[6]/E}]
set_clock_latency -max 0 [get_pins {M1_x_reg[7]/E}]
set_clock_latency -max 0 [get_pins {M1_y_reg[0]/E}]
set_clock_latency -max 0 [get_pins {M1_y_reg[1]/E}]
set_clock_latency -max 0 [get_pins {M1_y_reg[2]/E}]
set_clock_latency -max 0 [get_pins {M1_y_reg[3]/E}]
set_clock_latency -max 0 [get_pins {M1_y_reg[4]/E}]
set_clock_latency -max 0 [get_pins {M1_y_reg[5]/E}]
set_clock_latency -max 0 [get_pins {M1_y_reg[6]/E}]
set_clock_latency -max 0 [get_pins {M1_y_reg[7]/E}]
set_clock_latency -max 0 [get_pins {Y_reg[0]/E}]
set_clock_latency -max 0 [get_pins {Y_reg[1]/E}]
set_clock_latency -max 0 [get_pins {Y_reg[2]/E}]
set_clock_latency -max 0 [get_pins {Y_reg[3]/E}]
set_clock_latency -max 0 [get_pins {Y_reg[4]/E}]
set_clock_latency -max 0 [get_pins {Y_reg[5]/E}]
set_clock_latency -max 0 [get_pins {Y_reg[6]/E}]
set_clock_latency -max 0 [get_pins {Y_reg[7]/E}]
